app/views/tickets/show.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Order:</strong>
  <%= @ticket.order %>