app/controllers/event_venues_controller.rb

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @event_venue = EventVenue.find(params[:id])

SELECT  "event_venues".* FROM "event_venues" WHERE "event_venues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @event_venue = EventVenue.find(params[:id])

SELECT "event_venues".* FROM "event_venues"
---
  def index
    @event_venues = EventVenue.all