app/controllers/events_controller.rb

  def update
    @event = Event.find(params[:id])
    @event.update!(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "paloma mami"], ["description", "puro apoyo"], ["updated_at", "2019-04-10 21:55:57.988103"], ["id", 3]]

  def upcoming_events
    end_date = Date.today + 2.months
    @events = Event.where(start_date: Date.today...end_date)
---
SELECT "events".* FROM "events" WHERE "events"."start_date" >= ? AND "events"."start_date" < ?  [["start_date", "2019-04-10"], ["start_date", "2019-06-10"]]