app/controllers/tickets_controller.rb

  def update
    @ticket = Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]