app/controllers/users_controller.rb

INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "lastname" = ?, "email" = ?, "password" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "macarena"], ["lastname", "espinosa"], ["email", "lahmakytha@kuma.cl"], ["password", "makithakill"], ["address", "Pomaire"], ["updated_at", "2019-04-10 17:39:33.263327"], ["id", 6]]
---
  def update
  	@user = User.find(params[:id])
    @user.update!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) AS count_all, "users"."id" AS users_id FROM "users" WHERE "users"."id" IN (SELECT "orders"."user_id" FROM "orders") GROUP BY "users"."id"
---
  def user_with_most_tickets

    @user = User.find(Order.group(:user_id).order('COUNT(user_id) DESC').first.user_id)